class Solution {
  public int rangeBitwiseAnd(int m, int n) {
      //  這一題其實可以不用算，只要看該數字內最左邊範圍所有為1的個數
      /*
          08 0000 1000
          09 0000 1001
          10 0000 1010
          11 0000 1011
          12 0000 1100
          13 0000 1101
          14 0000 1110
          15 0000 1111
          8 -> 15 為 4
          因此只要m, n逐位往左比較，記錄要到i步才會達到m的位數與n的位數才會相等
          之後將m左移i步就好
      */
      int pos = 0;
      while (m != n) {
          m >>= 1;
          n >>= 1;
          pos++;
      }
      return m << pos;
  }
}